<template>
  <div class="privacy-container" style="margin: auto;width: 80%">
    <h1 style="text-align: center;font-weight: bold;padding: 20px 20px 20px 20px;font-size: 20px">在线学习平台隐私政策</h1>
    <p style="text-align: right">更新时间：2024年12月1日</p>
    <p style="text-align: right">生效时间：2024年12月1日</p>
    <p>欢迎您选择<span>在线学习平台（以下统称“我们”）</span>提供的产品及/或服务（下统称“服务”），
      我们尊重并保护所有使用服务用户（以下简称“您”）的个人隐私权。
      您在使用我们的服务时，我们将以高度的勤勉、审慎义务对待您的个人信息。
      为更好地保护您的权益，我们根据《中华人民共和国网络安全法》《信息安全技术个人信息安全规范》以及其他相关法律法规和技术规范，
      制定了《隐私政策》（以下简称“本《隐私政策》”）的相关内容，我们希望通过本《隐私政策》向您说明在您使用我们服务期间，
      我们收集及使用您个人信息的规则及相关事宜。<br>
      <span style="font-weight: bold;">如您对本《隐私政策》内/容有任何异议或疑问，您可通过本《隐私政策》文末的“联系方式”与我们取得联系。</span>
    </p>
    <p>本隐私政策与您所使用服务息息相关，一旦<span>您在弹窗页面点击“同意”或相关按钮</span>，意味着您已经接受本政策，
      并且在知情的基础上明确同意授权我们<span>按我国相关法律法规的规定及本政策的规定收集、处理、使用、存储您的个人信息。</span>
      尤其是黑色加粗条款（未成年人应当在其法定监护人陪同下阅读本《隐私政策》以及《儿童隐私保护政策》），您应重点阅读，在确认充分理解并同意后再开始使用。
      请注意我们会不时地检查并更新我们的政策，因此有关的措施会随之变化。
      我们恳请您定期光顾本页面，以确保对我们《隐私政策》最新版本始终保持了解。
      若您不同意本政策内容，将可能导致网络服务无法正常提供，或无法达到我们拟达到的服务效果，您应当停止使用我们的服务。
      <span>请您仔细阅读并充分理解相关内容：</span>
    </p>
    <p>一、我们如何收集和使用您的个人信息</p>
    <p>二、我们如何使用Cookie和同类技术</p>
    <p>三、我们如何共享、转让、公开披露您的个人信息</p>
    <p>四、您的权利</p>
    <p>五、未成年人保护</p>
    <p>六、本《隐私政策》的更新</p>
    <p>七、联系方式</p>
    <p>八、投诉和建议</p>

    <p><span>一、我们如何收集和使用您的个人信息</span></p>
    <p>当您使用我们产品和服务时，我们可能需要收集和使用您的一些个人信息，我们将严格遵守法律法规的规定及与用户的约定，将收集的信息用于以下用途。</p>

    <p><span>二、我们如何使用Cookie和同类技术</span></p>
    <p>我们可能会使用Cookie和同类技术，以提供更好的用户体验、质量和服务，包括保持用户登录状态、用户设置的个性化、帮助您完成交易等。</p>

    <p><span>三、我们如何共享、转让、公开披露您的个人信息</span></p>
    <p>我们不会向任何第三方共享、转让、公开披露您的个人信息，除非：</p>
    <p>（1）事先获得您的明确授权；</p>
    <p>（2）根据法律法规的规定或行政、司法机关的要求；</p>
    <p>（3）为维护社会公共利益、保护我们的合法权益之需要；</p>
    <p>（4）为维护我们的合法权益之需要；</p>
    <p>（5）为维护您或其他用户的人身、财产安全之需要。</p>

    <p><span>四、您的权利</span></p>
    <p>您有权访问、更正、删除您的个人信息，您还有权撤回您的授权同意。</p>

    <p><span>五、未成年人保护</span></p>
    <p>我们非常重视对未成年人个人信息的保护，我们将根据法律法规的规定，采取各种必要措施保护未成年人的个人信息。</p>

    <p><span>六、本《隐私政策》的更新</span></p>
    <p>我们可能会不时更新本《隐私政策》，我们鼓励您定期查看本《隐私政策》以了解我们如何保护您的信息。</p>





    <p style="font-weight: bold;">七、联系方式:</p>
    <p><span>邮箱：【2110147357@qq.com】</span></p>
    <p><span>电话：【13879805662】</span></p>

    <p><span>八、投诉和建议</span></p>
    <p>如果您对本《隐私政策》有任何疑问、意见或建议，或者对我们的个人信息保护工作有任何问题，欢迎您可以通过以上方式联系我们。</p>

  </div>

</template>

<script>
export default {
  mounted() {
    document.title = "在线学习平台隐私政策";
  }
};
</script>

<style>
.privacy-container p {
  font-size: 16px;
  line-height: 1.8;
}
.privacy-container span {
  font-size: 16px;
  font-weight: bold;
}
</style>